---
kind: property
id: P:Autodesk.Revit.UI.RevitCommandId.Name
source: html/ae38dc06-5009-5560-b940-5ddfaf38b376.htm
---
# Autodesk.Revit.UI.RevitCommandId.Name Property

The command name.

## Syntax (C#)
```csharp
public string Name { get; }
```